//slice এর কাজ হলো একটা অ্যারের শুরু ইন্ডেক্স থেকে শেষ ইন্ডেক্স এর মাধ্যবরতী এলিমেন্ট গুলোকে সরিয়ে ফেললে এবং মূল অ্যারের কোন পরিবর্তন করে না!
// যেমন এখানে(০,১,২) ২ নাম্বার ইন্ডেক্স থেকে শুরু করে ৬ নাম্বার ইন্ডেক্স মানে (২,৩,৪,৫) পর্যন্ত কেটে ফেলবে এবং part variable এ রাখবে
// কিন্তু numbers নামে মূল অ্যারের কোন পরির্বতন হবেনা
const numbers = [1,2,3,4,5,6,7,8];
const part = numbers.slice(2,6);
console.log(part);
console.log(numbers);
console.log('--------------------');
//splice কাজ হলো একটা অ্যারের শুরু ইন্ডেক্স থেকে কয়টি  এলিমেন্ট  সরিয়ে ফেলবে  তার বলে দিতে হবে অ্যান্ড সে সরিয়ে ফেলবে এবং মূল অ্যারের পরিবর্তন করে ফেলবে।
// যেমন এখাোনে বলা হয়েছে ২ নাম্বার ইন্ডেক্স থেকে ৫টি এলিমেন্ট কে সরিয়ে ফেলতে তাই সে ৩ থেকে ৭ পর্যন্ত সবাইকে সরিয়ে ফেলছে
// এবং মূল অ্যারের কে পরির্বতন করেছে ১ ২ ৮ আছে 
// চাইলে কিছু এলিমেন্ট কে ইনজেক্ট করে দিতে পারি, যেখান থেকে  splice করা হয়েছে যেমন ৯ কে ইনজেক্ট করেছি মূল অ্যারে numbers2 তে ( element: 1,2,9,8) 
const numbers2 = [1,2,3,4,5,6,7,8];
const part2 = numbers2.splice(2,5,9);
console.log(part2);
console.log(numbers2);
console.log('--------------------');
//join এর কাজ হলো অ্যারে এলিমেন্টগুলোর মাঝে কিছু যুক্ত করার জন্য ব্যবহার করা হয়!
// যেমন আমি এক্তা "হোয়াইট স্পেস + হোয়াইট স্পেস" যোগ করেছি সব এলিমেন্ট এর মাঝে
const numbers3 = [1,2,3,4,5,6,7,8];
const together = numbers3.join(' + ');
console.log(together);
